app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @event = Event.find(params[:id])
    @attendees = Attendance.where(event_id: @event.id).count
    @administrator = User.where(id: @event.administrator_id)

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "administrator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(
      start_date:       DateTime.new(params[:start_date_day].split("-")[0].to_i,
                        params[:start_date_day].split("-")[1].to_i,
                        params[:start_date_day].split("-")[2].to_i,
                        params[:start_date_hour].split("-")[0].to_i,
                        params[:start_date_hour].split("-")[1].to_i,
                        params[:start_date_hour].split("-")[2].to_i),
      duration:         params[:duration],
      title:            params[:description],
      description:      params[:description],
      price:            params[:price],
      location:         params[:location],
      administrator_id: params[:administrator_id]
    )

    if @event.save