app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @user_events_organizing = []
    @user_events = []
    events_id = []

    # On cherche les EVENT_ID auquel notre @USER participe
    # > On insert l'EVENT_ID dans #find() afin d'effectuer une requette sur la table EVENTS
    @user.attendances.each do |attendance|
      event_id = attendance.event_id
      Event.find(event_id).administrator_id == current_user.id ?
      @user_events_organizing << Event.find(event_id) :
      @user_events << Event.find(event_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = $1  [["user_id", 2]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]